<!-- APPLICATION -->

<% APP_NAME := %APPNAME% %>
<% CULTURE := en-AU %>
<% FORMAT_SHORTDATE := DD/MM/YY %>
<% FORMAT_LONGDATE := DD/MM/YYYY %>
<% FORMAT_TIME := hh:mm:ss %>
<% FORMAT_DATE_JSON := YYYY/MM/DD HH:mm:00 %>

<!-- CONSTANTS -->

<% S_ACTIONNOTFOUND := Action not found. Action %>
<% S_APPCONFIRM := Application Confirmation %>
<% S_APPLOG := Application Log %>
<% S_APPMSG := Application Message %>
<% S_AVAILPARTS := Available Parts %>
<% S_BAD := Bad %>
<% S_CHECKINGFORUPDATES := Checking for application updates. %>
<% S_CLEANINGSESSIONS := Cleaning sessions %>
<% S_CLEARINGMETHODS := Clearing all threads. %>
<% S_CREATEDTHREAD := Created new thread: #$1 %>
<% S_DELETE := Delete %>
<% S_DELETEREC := Are you sure you wish to delete this record? %>
<% S_ERR := Application Error %>
<% S_ERRORRPT := Error Report %>
<% S_EXAMPLEINC := How to include %APPNAME% Scripts: %>
<% S_EXAMPLEINCSTYLE := How to include %APPNAME% Styles: %>
<% S_EXPIRES := Expires %>
<% S_EXPPARTS := Expired Parts %>
<% S_FALSE := FALSE %>
<% S_FIELDNOTFOUND := Field not found %>
<% S_FIELDSREQUIRED := All form fields are required. %>
<% S_FINISHEDMETHOD := Finished method. %>
<% S_GOOD := Good %>
<% S_GOOGLEFRAME := Please install Google Chrome Frame %>
<% S_HELP := HELP %>
<% S_HOME := Dashboard %>
<% S_HOURSMINUTES := {0} hours {1} mins. %>
<% S_IDLETIME := Idle Time %>
<% S_INNERMSG := INNER MESSAGE: {0}. %>
<% S_INSERT := Insert %>
<% S_INVALIDREQ := Invalid request detected: {0} - Session: {1}. %>
<% S_KILLEDSESSION := Killed session: {0}. %>
<% S_KILLINGSESSION := Killing session: {0}. %>
<% S_LASTMETHOD := Last method in Queue #$1. %>
<% S_LESSTHANMIN := Less than 1 min. %>
<% S_LICENSEEXPIRED := One or more license parts have expired. Please contact support. %>
<% S_LICENSEINFO := License Information %>
<% S_LICENSENO := License Number %>
<% S_LICENSEDATE := License Date %>
<% S_LICENSEDTO := Licensed to %>
<% S_LICPRODUCT := Product %>
<% S_LICPRODVERSION := Product Version %>
<% S_LINKLICENSE := License %>
<% S_LINKPAGES := Refresh Pages %>
<% S_LOADING := Loading Framework %>
<% S_LOADINGPAGE := Loading PageViewer %>
<% S_LOGINPREV := Auto Login %>
<% S_LOGINPROMPT := Please login to continue. %>
<% S_LOGINTIME := Login Time %>
<% S_LOGOUT := LOGOUT %>
<% S_LOGOUTPROMPT := Are you sure you want to logout? %>
<% S_LOGOUTWARN := You have not logged out yet. %>
<% S_MAINMENU := MAIN MENU %>
<% S_MANUALLICCHECK := Manual license update check. %>
<% S_MINUTES := {0} mins. %>
<% S_NAVDATABASE := NAV Database %>
<% S_NAVCOMPANY := NAV Company %>
<% S_MODIFY := Modify %>
<% S_NEW := New %>
<% S_NEWPROCESS := New process request from {0}. %>
<% S_NEWQUEUE := Created new queue: #$1 with $2 methods. %>
<% S_NEXTMETHOD := Attempting next method in Queue #$1. %>
<% S_NOMETHOD := No method! Running next method. %>
<% S_NONEWUPDATES := There are no new updates. %>
<% S_OPENLICVIEWER := Opening License Viewer %>
<% S_OPENPAGEVIEWER := Opening PageViewer %>
<% S_OPENPREVLICVIEWER := Opening Previous License Viewer %>
<% S_OPENPREVPAGEVIEWER := Opening Previous PageViewer %>
<% S_PASSWORD := Password %>
<% S_PAGE := Page %>
<% S_QUERYMETHOD := Query Method: {0} %> 
<% S_QUEUEDTHREAD := Queued Thread: #$1. %>
<% S_REMEMBER := Remember Login Details? %>
<% S_REOPENPAGE := You must re-open the form for the changes to take effect. %>
<% S_RESIZEWINDOWS := Resizing $1 Windows. %>
<% S_REQUESTSESSION := Request Session ID: {0} %>
<% S_SERVERINFO := SERVER INFO %>
<% S_SERVERLOAD := Server Load %>
<% S_SESSIONID := Session ID %>
<% S_SETTINGCORS := Setting CORS headers for Firefox/Safari. %>
<% S_SOFTWARELICINFO := Software License Information %>
<% S_STARTEDTHREAD := Started Thread: #$1. %>
<% S_STOPPEDTHREAD := Stopped Thread: #$1. %>
<% S_SYNCCOMPLETE := User sync complete. %>
<% S_TABLE := Table %>
<% S_TOOLS := TOOLS %>
<% S_USER := User %>
<% S_USERNAME := Username %>
<% S_VIEW := View %>


<!-- ERROR STRINGS -->

<% ERR_BADLOGIN := Username or password is invalid. %>
<% ERR_BADVERSION := Your version of internet explorer is not compatible with %APPNAME%. Please install Google Chrome Frame in the following screen. %>
<% ERR_DBBADLOGIN := Invalid database login. Please check the username and password and try again. %>
<% ERR_DBBADSECURITY := Your user account is invalid. Please re-sync user accounts. %>
<% ERR_DBDATALAYER := DataLayer error. Please see event viewer for details. %>
<% ERR_DBLOSTCONNECTION := The database connection was lost. Please re-open {0}. %>
<% ERR_DBNOCONNECTION := A valid database connection was not found. %>
<% ERR_DBNODATABASE := The database was not found or was not accessible. %>
<% ERR_DBNOKEYS := {0} table does not have any primary keys. %>
<% ERR_DBNOMETADATA := {0} {1} does not have meta data. ({0} Corruption) %>
<% ERR_DIRDOESNOTEXIST := Directory {0} does not exist. %>
<% ERR_CONNECTIONLOST := Connection to the server has been lost. %>
<% ERR_EXPIRED := Your current session has expired. You have been idle for more than {0} %>
<% ERR_FILE := Sorry, the file you have requested was not found. %>
<% ERR_FILEMSG := The file you are looking for might have been removed, had its name changed, or is temporarily unavailable. %>
<% ERR_FNF := You may have applied an incorrect script or style tag. Please follow the examples below to apply the most current script and style tags. %>
<% ERR_FORMDOESNTEXIST := Form $1 does not exist. %>
<% ERR_FORMXML := An error has occurred while retriving the Form Definition from NAV. Please contact support. %>
<% ERR_INVFILE := Invalid file. %>
<% ERR_INVREQ := Invalid request. Please try again. %>
<% ERR_LICENSEEXCEEDED := You have exceded your licensed amount of {0}s for part {1}. %>
<% ERR_LICENCEPART := The {0} {1} must have a license part assigned to it. %>
<% ERR_LICENCEPARTID := Invalid object version id. %>
<% ERR_LICENCEPARTEXPIRED := License part {0} has expired. Please contact support. %>
<% ERR_LICENCEREQUEST := You have requested a {0} that is not in your license. Please change your license and try again. %>
<% ERR_LICENCESESSIONS := There are no available user sessions. %>
<% ERR_LOADFAILED := %APPNAME% failed to load. Please contact support. %>
<% ERR_MENUXML := An error has occurred while retriving the Menu Definition from NAV. Please contact support. %>
<% ERR_NOLICENSE := Unable to find a license file. Please make sure that a license file is in the License sub directory. %>
<% ERR_RECORDNOCOLS := Current record does not contain any columns. %>
<% ERR_NOTABLE := Table {0} does not exist. %>
<% ERR_NOTABLESAVE := Unable to save table. %>
<% ERR_NOTEXTERNAL := Form $1 cannot be viewed from an external URL. %>
<% ERR_NOTINLICENSE := You do not have permission to run Table {0} in your license file. %>
<% ERR_NOVIEW := View {0} does not exist. %>
<% ERR_ODDSTRLEN := Odd string length when even string length is required. %>
<% ERR_PARAMNOTFOUND := Parameter not found: %>
<% ERR_PROTECTEDNAME := {0} is a protected name. Please choose a different name. %>
<% ERR_RECORDBADFILTER := Incorrect filter value for {0}. %>
<% ERR_RECORDBADFILTERVALUE := Value: {0} is not in a correct format. %>
<% ERR_RECORDINSERT := Unable to insert {0} record. The record already exists. %>
<% ERR_RECORDINSERTPK := Unable to insert {0} record. Primary keys are not specified. %>
<% ERR_RECORDMODIFY := Unable to rename {0} record. The record already exists. %>
<% ERR_RECORDNOCOLS := Current record does not contain any columns. %>
<% ERR_RECORDNODELETEREF := You cannot delete the current record because it is referenced by another record. %>
<% ERR_RECORDNODELETE := delete from %>
<% ERR_RECORDNOEDIT := edit %>
<% ERR_RECORDNOINSERT := insert into %>
<% ERR_RECORDNOMODIFY := modify %>
<% ERR_RECORDNOPERMISSION := You do not have permission to {0} the {1} {2}. %>
<% ERR_RECORDNOREAD := access %>
<% ERR_RECORDNOTNEW := Cannot {0} a record that is not new. %>
<% ERR_SECURITYNOTFOUND := User security not found for user {0}. %>
<% ERR_SESSIONEXPIRED := Your current session has expired. %>
<% ERR_SQL := ERROR: {0} %>
<% ERR_SQLACTIONSNOTFOUND := Actions function does not exist. %>
<% ERR_SQLINSERT := Insert function failed to return a record. %>
<% ERR_SQLINSERTNOTFOUND := Insert trigger does not exist. %>
<% ERR_SQLLOGIN := Login function failed to return a value. %>
<% ERR_SQLLOGINNOTFOUND := Login function does not exist. %>
<% ERR_SQLLOOKUPNOTFOUND := Lookups function does not exist. %>
<% ERR_SQLNORECORDSET := There is no record set within the filter. %>
<% ERR_SQLSPECIFYKEYS := You must specify table keys on Form {0}. %>
<% ERR_THREADFAILED := Thread failed to start: #$1. %>
<% ERR_UILOAD := %APPNAME% UI not found! %>

<!-- SYSTEM STRINGS (These need to match exactly) -->

<% SYS_CONNSTR := The ConnectionString property %>
<% SYS_DUPLICATEKEY := Cannot insert duplicate key in object %>
<% SYS_ERR := error %>
<% SYS_FINDPROCERROR := Could not find stored procedure %>
<% SYS_FORMERR := Could not process node formsXML. %>
<% SYS_MENUERR := Could not process node menuGroupsXML. %>
<% SYS_LOGINERR := error occurred during the login process %>
<% SYS_REFERENCEDELETE := The DELETE statement conflicted with the REFERENCE constraint %>
<% SYS_REFLECTERROR := Exception has been thrown by the target of an invocation. %>
<% SYS_SECURITYSELECT := The SELECT permission was denied on the object %>
<% SYS_SECURITYUPDATE := The UPDATE permission was denied on the object %>
<% SYS_SECURITYDELETE := The DELETE permission was denied on the object %>
<% SYS_SECURITYINSERT := The INSERT permission was denied on the object %>
<% SYS_SERVERNOTFOUND := The server was not found or was not accessible. %>
<% SYS_SESSIONERROR := Your current session has expired %>
<% SYS_SQLERROR := ERROR: %>
<% SYS_TRANSROLL := The transaction was rollbacked %>
<% SYS_UNAUTHORIZEDERROR := The request failed with HTTP status 401: Unauthorized. %>

<!-- 3.2 -->

<% S_CHANGEPROFPIC := $1 has changed their profile picture %>
<% S_RECONNECTCONFIRM := Do you want to re-connect? %>
<% S_OFFLINE := Offline %>
<% S_CLEARPOPULAR := Clear Popular %>
<% S_ADDLINK := Add this link to the Main Menu? %>
<% S_REMOVELINK := Remove this link from the Main Menu?%>
<% S_CLEAPPOPCONFIRM := Are you sure you wish to clear popular pages? %>
<% S_CONNECTIVITY := You have limited or no connectivity. %>
<% S_CODE := Code Module %>

<% ERR_NOREC := Cannot find record: {0} %>
<% ERR_BADBROWSER := Your browser version is unsupported. Please upgrade your browser. %>
<% ERR_NOFILEUPLOAD := File upload is not supported in your browser. %>
<% ERR_NOCOOKIES := Cookies need to be enabled on your browser in order to use this function. Please contact support. %>
<% ERR_UNABLETOLOAD := Unable to load $1: $2 %>
<% ERR_PROTECTEDNAME := {0} is a protected field name. %>
<% ERR_RECORDUNIQUE := Unable to modify {0} record. The record is not unique. %>

<% SYS_INTERNALSERVERERR := internal server error %>
<% SYS_SERVERTOOBUSY := server too busy %>
<% SYS_DUPLICATEINDEX := Cannot insert duplicate key row in object %>

<!-- 4.0 -->

<% S_PAGEID := Page Name %>
